#### Importando Pandas

In [1]:
import pandas as pd

#### Cargando el DataSet

In [4]:
# Cargar el dataset
file_path = './data/ds_salaries.csv'
df = pd.read_csv(file_path)

# Mostrar las primeras 5 filas del dataset
df.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

#### Eliminando registros duplicados

* Ver los duplicados

In [5]:
# Identificar filas duplicadas
duplicados = df[df.duplicated()]

# Mostrar las filas duplicadas
duplicados

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
115,2023,SE,FT,Data Scientist,150000,USD,150000,US,0,US,M
123,2023,SE,FT,Analytics Engineer,289800,USD,289800,US,0,US,M
153,2023,MI,FT,Data Engineer,100000,USD,100000,US,100,US,M
154,2023,MI,FT,Data Engineer,70000,USD,70000,US,100,US,M
160,2023,SE,FT,Data Engineer,115000,USD,115000,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
3439,2022,MI,FT,Data Scientist,78000,USD,78000,US,100,US,M
3440,2022,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M
3441,2022,SE,FT,Data Engineer,115000,USD,115000,US,100,US,M
3586,2021,MI,FT,Data Engineer,200000,USD,200000,US,100,US,L
3709,2021,MI,FT,Data Scientist,76760,EUR,90734,DE,50,DE,L

* Eliminando los duplicados

In [7]:
# Eliminar duplicados
df_limpiados = df.drop_duplicates() #retorna el dataset sin los datos duplicados

# Verificar la cantidad de filas antes y después
rows_antes = len(df) #contamos la cantidad de duplicados
rows_despues = len(df_limpiados) #contamos la cantidad de filas limpias (sin duplicados)

print(f'Filas antes de eliminar duplicados: {rows_antes}')
print(f'Filas despues de eliminar duplicados: {rows_despues}')

Filas antes de eliminar duplicados: 3755
Filas despues de eliminar duplicados: 2584

#### Vemos los tipos de datos

In [9]:
# Verificar los tipos de datos de cada columna
df_limpiados.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

#### Consistencia de los valores de categorias

* Primero pasamos los datos a mayusculas para evitar cualquier variacion por diferencias por ejemplo (que haya un 'Dato' != 'dato')
* Nos aseguramos que sea unico

In [10]:
# Asegurar consistencia en la columna 'experience_level'
df_limpiados['experience_level'] = df_limpiados['experience_level'].str.upper()

# Verificar los valores unicos para confirmar la consistencia
df_limpiados['experience_level'].unique()

/var/folders/5d/7gh47wqd111dyfvyv6wz8xtw0000gn/T/ipykernel_16489/343618350.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_limpiados['experience_level'] = df_limpiados['experience_level'].str.upper()

array(['SE', 'MI', 'EN', 'EX'], dtype=object)